app/controllers/application_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def authenticate
    # we create an authenticate method to decode JSON Web tokens that users send us.
    # If we can successfully verify the token, we return the User object that represents the
    # user making the request. We're mostly interested in the happy path here and will bypass a lot of checks.
    authorization_header = request.headers['Authorization']
    token = authorization_header.split(" ").last if authorization_header
    decoded_token = JsonWebToken.decode(token)

    User.find(decoded_token[:user_id])