app/controllers/authentication_controller.rb

SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "manny"], ["LIMIT", 1]]
---
  def login
    # In the login action (the one that users hit for a token),
    # we grab the username and password from the parameters that come with the request to this controller.
    # If we can authenticate the user — that is, verify if their username and password match
    # what we have stored in our database — then we present them with a signed token and
    # information about when that token expires.
    user = User.find_by(username: params[:username])